# ElementIsElementTypeFilter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIsElementTypeFilter Constructor
ElementIsElementTypeFilter Class See Also
---
Constructs a new instance of a filter to match only ElementTypes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementIsElementTypeFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ElementIsElementTypeFilter()
```

# See Also
ElementIsElementTypeFilter Class
ElementIsElementTypeFilter Overload
Autodesk.Revit.DB Namespace